Source/app/controllers/setting_controller.rb

SELECT `settings`.* FROM `settings` WHERE `settings`.`id` = ? LIMIT 1  [["id", "1"]]
UPDATE `settings` SET `activity_quotes` = 10, `activity_level` = 0, `activity_calls` = 3, `activity_visits` = 9, `average_revenue` = 19, `average_end` = '2012-05-27' WHERE `settings`.`id` = 3
---
    def update
        @setting = Setting.find(current_user.setting.id)
        if @setting.update_attributes(params[:setting])