Source/app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 30 OFFSET 0
---
  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page], :per_page => 10)

INSERT INTO `users` (`admin`, `created_at`, `email`, `encrypted_password`, `name`, `salt`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO `settings` (`activity_calls`, `activity_level`, `activity_quotes`, `activity_visits`, `average_end`, `average_revenue`, `average_start`, `goal_end`, `goal_revenue`, `goal_start`, `user_id`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    if @user.save
      @setting = Setting.new(:user_id => @user.id);
      @setting.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", "5"]]
---
  def update
    @user = User.find(params[:id])