Source/app/views/pages/settings.html.erb

SELECT `settings`.* FROM `settings` WHERE `settings`.`user_id` = 5 LIMIT 1
---
    <div>
      <%= link_to "Link to Saleforce Account", omniauth_authorize_path(User, current_user.setting.crm_option), :class => current_user.setting.crm_option, :title => current_user.setting.crm_option if current_user.setting.crm_option && ["salesforce"].include?(current_user.setting.crm_option) %>